{
  "class_name": "Model",
  "config": {
    "name": "model_4",
    "layers": [
      {
        "name": "input_4",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            10,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_4"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv1d_64",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_64",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_58",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_58",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_64",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_58",
        "class_name": "Activation",
        "config": {
          "name": "activation_58",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_58",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_65",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_65",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_58",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_59",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_59",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_65",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_59",
        "class_name": "Activation",
        "config": {
          "name": "activation_59",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_59",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_66",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_66",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_59",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_60",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_60",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_66",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_28",
        "class_name": "Add",
        "config": {
          "name": "add_28",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_58",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_60",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_60",
        "class_name": "Activation",
        "config": {
          "name": "activation_60",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_28",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_67",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_67",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_60",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_61",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_61",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_67",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_61",
        "class_name": "Activation",
        "config": {
          "name": "activation_61",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_61",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_68",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_68",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_61",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_62",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_62",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_68",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_29",
        "class_name": "Add",
        "config": {
          "name": "add_29",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_60",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_62",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_62",
        "class_name": "Activation",
        "config": {
          "name": "activation_62",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_29",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_69",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_69",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_62",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_63",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_63",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_69",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_63",
        "class_name": "Activation",
        "config": {
          "name": "activation_63",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_63",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_70",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_70",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_63",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_64",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_64",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_70",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_30",
        "class_name": "Add",
        "config": {
          "name": "add_30",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_62",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_64",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_64",
        "class_name": "Activation",
        "config": {
          "name": "activation_64",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_30",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_71",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_71",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_64",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_65",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_65",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_71",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_65",
        "class_name": "Activation",
        "config": {
          "name": "activation_65",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_65",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_72",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_72",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_65",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_73",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_73",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            1
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_64",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_66",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_66",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_72",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_31",
        "class_name": "Add",
        "config": {
          "name": "add_31",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "conv1d_73",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_66",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_66",
        "class_name": "Activation",
        "config": {
          "name": "activation_66",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_31",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_74",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_74",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_66",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_67",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_67",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_74",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_67",
        "class_name": "Activation",
        "config": {
          "name": "activation_67",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_67",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_75",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_75",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_67",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_68",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_68",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_75",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_32",
        "class_name": "Add",
        "config": {
          "name": "add_32",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_66",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_68",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_68",
        "class_name": "Activation",
        "config": {
          "name": "activation_68",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_32",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_76",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_76",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_68",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_69",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_69",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_76",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_69",
        "class_name": "Activation",
        "config": {
          "name": "activation_69",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_69",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_77",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_77",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_69",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_70",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_70",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_77",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_33",
        "class_name": "Add",
        "config": {
          "name": "add_33",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_68",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_70",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_70",
        "class_name": "Activation",
        "config": {
          "name": "activation_70",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_33",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_78",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_78",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_70",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_71",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_71",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_78",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_71",
        "class_name": "Activation",
        "config": {
          "name": "activation_71",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_71",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_79",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_79",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_71",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_80",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_80",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            1
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_70",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_72",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_72",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_79",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_34",
        "class_name": "Add",
        "config": {
          "name": "add_34",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "conv1d_80",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_72",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_72",
        "class_name": "Activation",
        "config": {
          "name": "activation_72",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
