{
  "class_name": "Model",
  "config": {
    "name": "model_19",
    "layers": [
      {
        "name": "input_19",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            10,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_19"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv1d_421",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_421",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_19",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_343",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_343",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_421",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_427",
        "class_name": "Activation",
        "config": {
          "name": "activation_427",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_343",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_422",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_422",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_427",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_344",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_344",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_422",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_428",
        "class_name": "Activation",
        "config": {
          "name": "activation_428",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_344",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_423",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_423",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_428",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_345",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_345",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_423",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_163",
        "class_name": "Add",
        "config": {
          "name": "add_163",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_427",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_345",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_429",
        "class_name": "Activation",
        "config": {
          "name": "activation_429",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_163",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_424",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_424",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_429",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_346",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_346",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_424",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_430",
        "class_name": "Activation",
        "config": {
          "name": "activation_430",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_346",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_425",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_425",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_430",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_347",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_347",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_425",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_164",
        "class_name": "Add",
        "config": {
          "name": "add_164",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_429",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_347",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_431",
        "class_name": "Activation",
        "config": {
          "name": "activation_431",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_164",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_426",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_426",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_431",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_348",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_348",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_426",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_432",
        "class_name": "Activation",
        "config": {
          "name": "activation_432",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_348",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_427",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_427",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_432",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_349",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_349",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_427",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_165",
        "class_name": "Add",
        "config": {
          "name": "add_165",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_431",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_349",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_433",
        "class_name": "Activation",
        "config": {
          "name": "activation_433",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_165",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_428",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_428",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_433",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_350",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_350",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_428",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_434",
        "class_name": "Activation",
        "config": {
          "name": "activation_434",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_350",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_429",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_429",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_434",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_430",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_430",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            1
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_433",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_351",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_351",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_429",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_166",
        "class_name": "Add",
        "config": {
          "name": "add_166",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "conv1d_430",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_351",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_435",
        "class_name": "Activation",
        "config": {
          "name": "activation_435",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_166",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_431",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_431",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_435",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_352",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_352",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_431",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_436",
        "class_name": "Activation",
        "config": {
          "name": "activation_436",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_352",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_432",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_432",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_436",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_353",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_353",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_432",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_167",
        "class_name": "Add",
        "config": {
          "name": "add_167",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_435",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_353",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_437",
        "class_name": "Activation",
        "config": {
          "name": "activation_437",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_167",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_433",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_433",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_437",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_354",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_354",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_433",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_438",
        "class_name": "Activation",
        "config": {
          "name": "activation_438",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_354",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_434",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_434",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_438",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_355",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_355",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_434",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_168",
        "class_name": "Add",
        "config": {
          "name": "add_168",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_437",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_355",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_439",
        "class_name": "Activation",
        "config": {
          "name": "activation_439",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_168",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_435",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_435",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_439",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_356",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_356",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_435",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_440",
        "class_name": "Activation",
        "config": {
          "name": "activation_440",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_356",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_436",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_436",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_440",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_437",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_437",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            1
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_439",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_357",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_357",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_436",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_169",
        "class_name": "Add",
        "config": {
          "name": "add_169",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "conv1d_437",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_357",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_441",
