{
  "class_name": "Model",
  "config": {
    "name": "model_7",
    "layers": [
      {
        "name": "input_7",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            10,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_7"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv1d_169",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_169",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_115",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_115",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_169",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_199",
        "class_name": "Activation",
        "config": {
          "name": "activation_199",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_115",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_170",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_170",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_199",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_116",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_116",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_170",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_200",
        "class_name": "Activation",
        "config": {
          "name": "activation_200",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_116",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_171",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_171",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_200",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_117",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_117",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_171",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_55",
        "class_name": "Add",
        "config": {
          "name": "add_55",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_199",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_117",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_201",
        "class_name": "Activation",
        "config": {
          "name": "activation_201",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_55",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_172",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_172",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_201",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_118",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_118",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_172",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_202",
        "class_name": "Activation",
        "config": {
          "name": "activation_202",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_118",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_173",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_173",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_202",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_119",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_119",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_173",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_56",
        "class_name": "Add",
        "config": {
          "name": "add_56",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_201",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_119",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_203",
        "class_name": "Activation",
        "config": {
          "name": "activation_203",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_56",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_174",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_174",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_203",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_120",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_120",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_174",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_204",
        "class_name": "Activation",
        "config": {
          "name": "activation_204",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_120",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_175",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_175",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_204",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_121",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_121",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_175",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_57",
        "class_name": "Add",
        "config": {
          "name": "add_57",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_203",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_121",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_205",
        "class_name": "Activation",
        "config": {
          "name": "activation_205",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_57",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_176",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_176",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_205",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_122",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_122",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_176",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_206",
        "class_name": "Activation",
        "config": {
          "name": "activation_206",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_122",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_177",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_177",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_206",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_178",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_178",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            1
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_205",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_123",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_123",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_177",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_58",
        "class_name": "Add",
        "config": {
          "name": "add_58",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "conv1d_178",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_123",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_207",
        "class_name": "Activation",
        "config": {
          "name": "activation_207",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_58",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_179",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_179",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_207",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_124",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_124",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_179",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_208",
        "class_name": "Activation",
        "config": {
          "name": "activation_208",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_124",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_180",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_180",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_208",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_125",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_125",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_180",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_59",
        "class_name": "Add",
        "config": {
          "name": "add_59",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_207",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_125",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_209",
        "class_name": "Activation",
        "config": {
          "name": "activation_209",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_59",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_181",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_181",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_209",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_126",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_126",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_181",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_210",
        "class_name": "Activation",
        "config": {
          "name": "activation_210",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_126",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_182",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_182",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_210",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_127",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_127",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_182",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_60",
        "class_name": "Add",
        "config": {
          "name": "add_60",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_209",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_127",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_211",
        "class_name": "Activation",
        "config": {
          "name": "activation_211",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_60",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_183",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_183",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_211",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_128",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_128",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_183",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_212",
        "class_name": "Activation",
        "config": {
          "name": "activation_212",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_128",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_184",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_184",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_212",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_185",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_185",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            1
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_211",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_129",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_129",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_184",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_61",
        "class_name": "Add",
        "config": {
          "name": "add_61",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "conv1d_185",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_129",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_213",
        "class_name": "Activation",
