{
  "class_name": "Model",
  "config": {
    "name": "model_13",
    "layers": [
      {
        "name": "input_13",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            10,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_13"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv1d_253",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_253",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_13",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_229",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_229",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_253",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_229",
        "class_name": "Activation",
        "config": {
          "name": "activation_229",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_229",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_254",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_254",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_229",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_230",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_230",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_254",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_230",
        "class_name": "Activation",
        "config": {
          "name": "activation_230",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_230",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_255",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_255",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_230",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_231",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_231",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_255",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_109",
        "class_name": "Add",
        "config": {
          "name": "add_109",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_229",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_231",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_231",
        "class_name": "Activation",
        "config": {
          "name": "activation_231",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_109",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_256",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_256",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_231",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_232",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_232",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_256",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_232",
        "class_name": "Activation",
        "config": {
          "name": "activation_232",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_232",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_257",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_257",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_232",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_233",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_233",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_257",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_110",
        "class_name": "Add",
        "config": {
          "name": "add_110",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_231",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_233",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_233",
        "class_name": "Activation",
        "config": {
          "name": "activation_233",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_110",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_258",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_258",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_233",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_234",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_234",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_258",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_234",
        "class_name": "Activation",
        "config": {
          "name": "activation_234",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_234",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_259",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_259",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_234",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_235",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_235",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_259",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_111",
        "class_name": "Add",
        "config": {
          "name": "add_111",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_233",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_235",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_235",
        "class_name": "Activation",
        "config": {
          "name": "activation_235",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_111",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_260",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_260",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_235",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_236",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_236",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_260",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_236",
        "class_name": "Activation",
        "config": {
          "name": "activation_236",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_236",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_261",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_261",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_236",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_262",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_262",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            1
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_235",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_237",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_237",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_261",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_112",
        "class_name": "Add",
        "config": {
          "name": "add_112",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "conv1d_262",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_237",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_237",
        "class_name": "Activation",
        "config": {
          "name": "activation_237",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_112",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_263",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_263",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_237",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_238",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_238",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_263",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_238",
        "class_name": "Activation",
        "config": {
          "name": "activation_238",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_238",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_264",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_264",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_238",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_239",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_239",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_264",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_113",
        "class_name": "Add",
        "config": {
          "name": "add_113",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_237",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_239",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_239",
        "class_name": "Activation",
        "config": {
          "name": "activation_239",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_113",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_265",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_265",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_239",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_240",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_240",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_265",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_240",
        "class_name": "Activation",
        "config": {
          "name": "activation_240",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_240",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_266",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_266",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_240",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_241",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_241",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_266",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_114",
        "class_name": "Add",
        "config": {
          "name": "add_114",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "activation_239",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_241",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_241",
        "class_name": "Activation",
        "config": {
          "name": "activation_241",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "add_114",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_267",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_267",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_241",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_242",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_242",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_267",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_242",
        "class_name": "Activation",
        "config": {
          "name": "activation_242",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_242",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_268",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_268",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_242",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_269",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_269",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            1
          ],
          "strides": [
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_241",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_243",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_243",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_268",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_115",
        "class_name": "Add",
        "config": {
          "name": "add_115",
          "trainable": true,
          "dtype": "float32"
        },
        "inbound_nodes": [
          [
            [
              "conv1d_269",
              0,
              0,
              {}
            ],
            [
              "batch_normalization_243",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_243",
